Tutorial/reversePulseRDENewman/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T.orig;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    axis
    {
	type            empty;     
    }
    
    "wedge.*"
    {
        type            wedge;
    } 
    
    "wall_isolation.*"
    {
        type            zeroGradient;//symmetry;
    }
    
    wall_WE
    {
        name            cathode_T1;
        type            codedMixed;
        refValue        $internalField;//
        refGradient     uniform 0;
        valueFraction   uniform 1;
        #include        "codedBC_T.H"
        

    }
     
    wall_CE
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
