Tutorial/reversePulseRDENewman/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    axis
    {
	type            empty;     
    }
    
    "wedge.*"
    {
        type            wedge;
    } 
        
    "wall.*"
    {
        type            noSlip;
    }
    
    wall_WE
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           31.4; // Rotational speed in radians/sec
    }
    
    
    "wall_isolation.*"
    {
        //type            pressureInletOutletVelocity;
    	//value          uniform (0 0 0);
    	//type            zeroGradient;//symmetry;
    	type            noSlip;
    }

}


// ************************************************************************* //
