Tutorial/reversePulseRDENewman/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    axis
    {
	type            empty;     
    }
    
    "wedge.*"
    {
        type            wedge;
    } 
    
    "wall_isolation.*"
    {
        //type            zeroGradient;//symmetry;
        type            calculated;
        value           uniform 0;
    }
    wall_WE
    {
        type            calculated;
        value           uniform 0;
    }
    wall_CE
    {
        type            fixedValue;
        value           uniform 0;
    } 
}


// ************************************************************************* //
