Tutorial/reversePulseRDENewman/0.orig/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       pointVectorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    axis
    {
	type            empty;     
    }
    
    "wedge.*"
    {
        type            wedge;
    } 
    
    wall_WE 
    {
        name            codedGradC_WE;
        type    	codedFixedValue;
        value   	$internalField;
        #include        "codedBC.H"       
    }
    
    wall_isolation_rot
    {
        type            fixedNormalSlip;
        n               (0 0 1);
    }
    wall_isolation
    {
        type            fixedNormalSlip;
        n               (1 0 0);
    }
    
    /*insulator_top
    {
        type            fixedNormalSlip;
        n               (0 1 0);
    }*/

    wall_CE
    {
        type            fixedNormalSlip;
        n               (0 0 1);
        /*name            codedGradC_CE;
        type    	codedFixedValue;
        value   	$internalField;
        #include        "codedBC.H" */  
    }
}

// ************************************************************************* //
