Tutorial/reversePulseRDENewman/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;

pi 3.141592;
tita 5;//grados totales

le 15;
Re 7.5;
Ri 2.5;

e 
          ( 
              //(0.025 0.15 10) //  y.x.z-dir, % cells, expansion 
	      (0.5 0.3 1)
              (0.425 0.4 0.5)
	      (0.075 0.3 0.1)
          );
e1  1;/*
          ( 
	      (0.9 0.8 1) //  y.x.z-dir, % cells, expansion 
	      (0.1 0.2 0.1)
          );*/

vertices
(

(	0.000000000000	0.000000000000	0.000000000000	)
(	#eval "cos($pi/180*$tita/2)*$Ri"	#eval "-sin($pi/180*$tita/2)*$Ri"	0.000000000000	)
(	#eval "cos($pi/180*$tita/2)*$Re"	#eval "-sin($pi/180*$tita/2)*$Re"	0.000000000000	)
(	#eval "cos($pi/180*$tita/2)*$Re"	#eval "sin($pi/180*$tita/2)*$Re"	0.000000000000	)
(	#eval "cos($pi/180*$tita/2)*$Ri"	#eval "sin($pi/180*$tita/2)*$Ri"	0.000000000000	)
				
(	0.000000000000	0.000000000000	$le	)
(	#eval "cos($pi/180*$tita/2)*$Ri"	#eval "-sin($pi/180*$tita/2)*$Ri"	$le	)
(	#eval "cos($pi/180*$tita/2)*$Re"	#eval "-sin($pi/180*$tita/2)*$Re"	$le	)
(	#eval "cos($pi/180*$tita/2)*$Re"	#eval "sin($pi/180*$tita/2)*$Re"	$le	)
(	#eval "cos($pi/180*$tita/2)*$Ri"	#eval "sin($pi/180*$tita/2)*$Ri"	$le	)
				
);

blocks
(
	hex (0 1 4 0 5 6 9 5) (30 1 70) simpleGrading (1 1 $e)
	hex (1 2 3 4 6 7 8 9) (65 1 70) simpleGrading ($e1 1 $e)
);

edges
(

arc 1 4 ($Ri 0 0)
arc 6 9 ($Ri 0 $le)

arc 2 3 ($Re 0 0)
arc 7 8 ($Re 0 $le)

);

boundary
(

axis
{
type  empty;
	faces
	(
		(0 5 5 0)
	);
}

wall_CE
{
type wall;
	faces
	(
		(1 4 3 2)
		(0 4 1 0)
	);
}

wall_isolation_rot
{
type wall;
	faces
	(
		(6 7 8 9)
	);
}


wall_WE
{
type wall;
	faces
	(
		(5 6 9 5)
		
	);
}

wall_isolation
{
type wall;
	faces
	(
		(2 3 8 7)
		
	);
}

wedge_front
{
type wedge;       
	faces
	(
		(0 1 6 5)
		(1 2 7 6)
	);
}

wedge_back
{
type wedge;
	faces
	(
		(4 0 5 9)
		(3 4 9 8)
	);
}

);

mergePatchPairs
(

);


// ************************************************************************* //
