Tutorial/reversePulseRDENewman/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     currentDistributionNatConMovingMesh;

startFrom       latestTime;//startTime;//

startTime       0;

stopAt          endTime;

endTime		1800;  //

deltaT		0.0005;

writeControl    runTime;

writeInterval   600;//

purgeWrite      0;

writeFormat     ascii;//binary;//

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;

adjustTimeStep  yes;//  no;//

maxCo           2;//0.5;


/*libs (
	"libgroovyBC.so"
	"libOpenFOAM.so"
);*/

// ************************************************************************* //
