Tutorial/reversePulseRDENewman/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom    patch;//surface;//mesh;//
/*
patch:   patch of sourceCase
mesh:    patch of sourceCase, retaining original mesh
surface: surface geometry file
*/

sourceCase       "$FOAM_CASE";   // uses current case; can be a separate case
sourcePatches    (frontAndBack);
// surface       "geometry.obj"; // constructFrom surface

// constructFrom patch: name of exposed "original" patch
exposedPatchName front;

flipNormals      true;//false;

extrudeModel     linearNormal;//plane;
/*
linearNormal:    linear extrusion in point-normal direction
plane:           single-layer, point-normal extrusion with empty type (2D)
linearDirection: linear extrusion in specified direction
wedge:           single-layer, wedge extrusion with wedge type (axisymmetric)
sector:          sector extrusion about specified axis
linearRadial:    linear extrusion in radial direction
sphericalRadial: spherical radial extrusion with radii function
*/

//thickness        0.01; // used by plane extrusion

nLayers          1;
expansionRatio   1.0;

// Merge front and back patches, typically for 360 deg wedge extrusion
mergeFaces       false;
mergeTol         0;

linearNormalCoeffs
{
    thickness    1e-4;//0.001;
}

/*linearDirectionCoeffs
{
    direction    (0 0 1);
    thickness    0.01;
}*/

/*sectorCoeffs // used by sector and wedge extrusion
{
    axisPt       (0 0 0);
    axis         (1 0 0);
    angle        360;
}

linearRadialCoeffs
{
    R            0.5;
    Rsurface     0.1;
}

sphericalRadialCoeffs
{
    R            table ((0 0.01) (3 0.03) (10 0.1));
}*/


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * /
