Tutorial/reversePulseRDENewman/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0.01;
    }
    
    
    fi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
    }
    
    fiFinal
    {
        $fi;
        //tolerance       1e-7;
        relTol          1e-4;
    }
    
    "(U|T|rho_i|k|epsilon|omega|ReThetat|gammaInt|nuTilda|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }
    
    /*gammaInt
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
        maxIter         10;
    }
    
    ReThetat
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
        maxIter         10;
    }*/
      
    "(U|T|rho_i|k|epsilon|omega|ReThetat|gammaInt|nuTilda|R)Final"
    {
        $U;
        minIter         3;
        relTol          0;
    }
    
    "cellMotionU.*"
    {
    
	solver          GAMG;
        tolerance       1e-10;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        minIter         1;
        maxIter         100;   
        /*solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;*/
    }
    pcorr
    {
        $p_rghFinal;
        preconditioner  DIC;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0.001;
    }
}

PIMPLE
{
    consistent          yes; //no;// //SIMPLEC
    momentumPredictor   yes; //no; // //false;//
    //correctPhi          yes;//yes;
    nOuterCorrectors    1;//2;//
    nCorrectors         3;//1;
    nNonOrthogonalCorrectors 0;//1;
    moveMeshOuterCorrectors  true;
    pRefCell        0;
    pRefValue       0;
    
    residualControl//outerCorrectorResidualControl
    {
        "fi.*"
        {
                tolerance  1e-04;
                relTol      0;
        }
       /* p
        {
                tolerance  5e-4;
                relTol      0;
        }*/
    }

}

relaxationFactors
{
    /*fields
    {
         p      0.3;
         pFinal   1;
    }*/
    equations
    {
        "(U|T|rho_i|k|epsilon|omega|R)" 1;
        "(U|T|rho_i|k|epsilon|omega|R)Final" 1;
    }
}




// ************************************************************************* //
